{
  "title": "About Page",
  "bio": "Yeung is an artist specializing in performance and installation art. She graduated from RMIT with a Bachelor of Arts in Fine Arts. Her creative themes explore the \"body,\" \"soul,\" \"nature,\" and \"social issues,\" aiming to re-examine the concept of the \"body\" from various perspectives. Through her exploration, Yeung investigates the relationships between the soul and the flesh, as well as the connections among \"life,\" \"nature,\" and \"society.\" She expresses her ideas through a diverse range of media, integrating painting, ceramics, video, sound, and performance art to create multifaceted artistic expressions.\n\nIn 2022, Yeung co-founded c.95d8, an art co-living space, and the Crip Art Residency Program promoting crip culture and fostering inclusive artistic dialogue in Hong Kong.\n",
  "exhibitions": [
    "2025 “520”, Prosthesis: Queer Crip Performance & Archive Exhibition, Eaton, Hong Kong",
    "2024 “Farm Paradise”, JCCAC, Flipside Art, Hong Kong",
    "2024 “Questscape”, ART Basel, Parasite, Hong Kong",
    "2023 “Wiggle”, self - fatten exhibition, c.95d8, Hong Kong",
    "2022 LOVE+ Awakenings, Gay Games Hong Kong 2023, Pao Galleries, Hong Kong",
    "2021 Phantom, JCCAC, Hong Kong",
    "2021 Displaced-Mayflower 400, Southampton, UK",
    "2021 ‘Storm’ Rachel Gadsden &the Deluge Collective, UK",
    "2020 White, JCCAC, Hong Kong",
    "2020沉暮光雲, Foo Tak Building, Hong Kong",
    "2020 Cross All Borders 2020: Dare to Create!, JCCAC, Hong Kong",
    "2019 ‘Body Schema’ Solo Exhibition, Diana Cheung Experimental Gallery, Hong Kong",
    "2018 FRESH TREND 2018 HK, Hong Kong City Hall, Hong Kong",
    "2018 SOMETIMES IRRELEVANT, Pao Galleries, Hong Kong",
    "2016 Cross All Borders: Hong Kong Festival Showcasing New Visual Artists with Disabilities, JCCAC, Hong Kong",
    "2015 Agnès b. RUE DE MARSEILLE, K11, Hong Kong",
    "2015口足畫藝－彩繪生命色彩展覽, Citywalk gallery, Hong Kong",
    "2014「傷健同行畫展」, Hong Kong Central Library, Hong Kong",
    "2012 MFPA Exhibition, Sun Yat-sen Memorial Hall, Taipei",
    "2012 Cross All Borders: Hong Kong Festival Showcasing New Visual Artists with Disabilities, JCCAC, Hong Kong",
    "2010 Cross All Borders: Hong Kong Festival Showcasing New Visual Artists with Disabilities, JCCAC, Hong Kong",
    "2009 Embracing Life – contemplation In Drizzle Art Exhibition at the Chinese Cultural of Greater Toronto."
  ],
  "performances": [
    "2025 ‘Who’s staring at me?”, Prosthesis: Queer Crip Performance & Archive Exhibition, Eaton, Hong Kong",
    "2025 “Same but different”, Art Avant Garde festival, M+, Hong Kong",
    "2024 “Farm Paradise”, JCCAC, Flipside Art, Hong Kong",
    "2024 “Untitle”, Cattle Depot Artist village, Hong Kong",
    "2024 “Stranger”, ART Basel, Parasite, Hong Kong",
    "2023 “Wiggle”, self - fatten exhibition, c.95d8, Hong Kong",
    "2022 “Tame Sight”, Myth Makers—Spectrosynthesis III, Tai Kwun Contemporary, Hong Kong",
    "2022 “The squirm”, Gay Games Hong Kong 2023, Pao Galleries, Hong Kong",
    "2022 “Power Play”, Movement Festival 2022, Eaton, Hong Kong",
    "2022 “A process of good bye”, Sai Kung, Hong Kong ",
    "2022 “Tilt and Level – Group improvisation”, Per.platforme, tomorrowmaybe, Hong Kong",
    "2022 “In God’s body”, PHD Group and Virtue Village, Hong Kong",
    "2022 “Balance”, C.95d8, Hong Kong",
    "2022 “unstable equilibrium”, CCDC, JCCAC, Hong Kong",
    "2022 “Turn as Turn”, CCDC, Hong Kong",
    "2022 “Fragilely Connected”, Pak Kong Garden, Hong Kong",
    "2021 “Untitled”, 5+2 studio, Hong Kong",
    "2021 “I’m fine.” , Per.platforme, Videotage, Hong Kong",
    "2021 “Disc’, Per.platforme, 135YCS, Hong Kong",
    "2021 ‘Two World’, Phantom, JCCAC, Hong Kong",
    "2019 ‘In vain’, South Island Art Day, Art statements , Wong Chuk Hang, Hong Kong",
    "2018 ‘Inside the wall’, South Island Art Day , Art statements , Wong Chuk Hang, Hong Kong",
    "2017 <STRANGERS IN THE GARDEN 2- Black Milk & White Coal>Exchange Performance Project , HK BUTOH SEASON 2017, Tong Three, Hong Kong",
    "2017 WE DANCE AT FREESPACE HAPPENING, Westkowloon, Hong Kong ",
    "2016 OPEN DANCE＃16 A Barrier – free Inclusive Dance Party, Westkowloon, Hong Kong"
  ],
  "awards": [
    "2016 Cross All Borders: Hong Kong Festival Showcasing New Visual Artists with Disabilities (Golden Award)",
    "2012 Cross All Borders: Hong Kong Festival Showcasing New Visual Artists with Disabilities (bronze Award)"
  ]
}