{
  "works": [
    {
      "image": "/images/uploads/work_2022_百家碗筷_photo_no0.jpg",
      "description": "作品概念源自思考不同狀態下的晚餐。\n每一天最能令我們放鬆的時光就是晚餐時段，這短暫的時光讓人放下手上的工作、生活中的瑣碎和煩惱，好好放鬆和休息。\n帶着這個概念，我開始尋找100個陌生人，邀請他們讓我到他們家作客並共進晚飯，透過這段時間了解他們的日常、真實樣貌和其故事。\n（此作品正在進行中）\n\nThe concept of the work comes from thinking about dinner in different states.\nThe most relaxing time every day is dinner time. This short time allows people to let go of their work, trivialities and troubles in life, and have a good time to relax and rest.\nWith this concept in mind, I started looking for 100 strangers, inviting them to let me visit their homes and have dinner together, and learn about their daily lives, their real appearances, and their stories through this time.\n(this work is in progress)",
      "url": ""
    },
    {
      "image": "/images/uploads/2022_2_the_squirm_motion_9.jpg",
      "description": "\"The squirm\" , 2022, 45mins, Live Performance\n\nBock the squirm\nThe squirm blocked a life\nLife blocking our mind\n",
      "url": "/performance/2022-08-the-squirm"
    },
    {
      "image": "/images/uploads/2022_6_balance__dsf1031.jpg",
      "description": "“Balance”, PING PANG X SIU FONG YEUNG, 60mins, live performance \n\nFinding the balance point in between. It’s about gravity, weight, senses, and silent un-derstanding.\n",
      "url": "/performance/2022-04-balance"
    },
    {
      "image": "/images/uploads/2022_10_fragilely_connected_motion_3.jpg",
      "description": "“Fragilely Connected”, 2022, Performance Documentary\nPerformed by Yeung Siu Fong & RiK Wing Kei Yu\n\nIt was 2022 Equinox, a Sunday. It was inside an alined playground where people used to meet up while children played.\n\nWith that green fabric, we tried to connect and yet we were kept at a distance. Movements seemed to be in response yet tensioned with fragileness.\n\nPhoto by Ann HuanPerformed by Yeung Siu Fong & RiK Wing Kei Yu\nPhoto by Ann Huang\n",
      "url": "/performance/2022-01-fragilely-connected"
    }
  ]
}
